// pure mock data, for special levels only
// in the format of level, category, id
var blacklist = [
	['冰雪舞会1', '外套', '236'],
	['冰雪舞会1', '下装', '059'],

	['冰雪舞会2', '外套', '213'],
	['冰雪舞会2', '外套', '260'],
	['冰雪舞会2', '连衣裙', '591'],
	['冰雪舞会2', '连衣裙', '592'],
	['冰雪舞会2', '连衣裙', '594'],
	['冰雪舞会2', '连衣裙', '595'],
	['冰雪舞会2', '连衣裙', '393'],
	['冰雪舞会2', '连衣裙', '060'],
	['冰雪舞会2', '上衣', '309'],

  ['冰雪舞会3', '连衣裙', '598'],
  ['冰雪舞会3', '连衣裙', '480'],
  ['冰雪舞会3', '连衣裙', '343'],
	['冰雪舞会3', '上衣', '408'],
	['冰雪舞会3', '下装', '375'],

	['冰雪舞会4', '下装', '375'],

	['冰雪舞会5', '外套', '239'],
	['冰雪舞会5', '连衣裙', '040'],
	['冰雪舞会5', '连衣裙', '041'],
	['冰雪舞会5', '连衣裙', '042'],
	['冰雪舞会5', '连衣裙', '033'],
	['冰雪舞会5', '连衣裙', '409'],
	['冰雪舞会5', '连衣裙', '038'],
	['冰雪舞会5', '连衣裙', '390'],
	['冰雪舞会5', '连衣裙', '603'],
	['冰雪舞会5', '连衣裙', '573'],
];